ERP.belugaerp/src/Documents/РаспределениеПроизводственныхЗатрат/РаспределениеПроизводственныхЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РаспределениеПроизводственныхЗатрат</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ПартииПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ПартияПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Этап</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/AccumulationRegisters/ВыпускПродукции/ВыпускПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВыпускПродукции</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <registerRecords>InformationRegister.бг_ДвижениеМарок</registerRecords>
  <attributes>
    <name>бг_ДатаОтгрузкиВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>бг_СтранаНазначения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НазначениеМатериалы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПартияПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РасходОднойДатой</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Этап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ПроизводственнаяЛиния</name>
      <type>
        <types>CatalogRef.бг_ПроизводственныеЛинии</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Произведено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбеспечениеМатериаламиИРаботами</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>бг_ДополнительныйРасход</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Обособленно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямМатериалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>бг_АкцизПоПриобретеннымЦенностямПродукция</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>бг_Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОсновноеИзделиеУпаковкаПаллета</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_Экспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзделиеНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВозвратныеОтходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Documents/РаспределениеПроизводственныхЗатрат/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура бг_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	бг_ДобавитьКомандуРаспределенияМатериалов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура бг_РаспределитьМатериалыПоПартиямПроизводства(Команда)
	бг_РаспределитьМатериалыПоПартиямПроизводстваНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура бг_ПересчитатьРаспределениеМатериаловПоПартиямПроизводства(Команда)
	бг_ПересчитатьРаспределениеМатериаловПоПартиямПроизводстваНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура бг_ДобавитьКомандуРаспределенияМатериалов()
	бг_ГруппаКоманд = бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьГруппуНаФорму(
								ЭтотОбъект,
								"бг_ГруппаКомандРаспредениеМатериаловПоПартиямПроизводства",
								Элементы.ПартииПроизводстваКоманднаяПанель,
								ВидГруппыФормы.Подменю);
	бг_ГруппаКоманд.Заголовок = НСтр("ru = 'Распределение материалов'");
	
	ИмяКоманды       = "бг_РаспределитьМатериалыПоПартиямПроизводства";
	ЗаголовокКоманды = НСтр("ru = 'Распределить материалы по партиям производства'");
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьКнопкуНаФорму(
								ЭтотОбъект,
								ИмяКоманды,
								бг_ГруппаКоманд,
								ЗаголовокКоманды,
								ИмяКоманды,
								ИмяКоманды, ,
								ВидКнопкиФормы.КнопкаКоманднойПанели);
	
	ИмяКоманды       = "бг_ПересчитатьРаспределениеМатериаловПоПартиямПроизводства";
	ЗаголовокКоманды = НСтр("ru = 'Пересчитать распределение материалов по партиям производства'");
	бг_МодификацияИнтерфейсовОбщегоНазначенияСервер.ДобавитьКнопкуНаФорму(
								ЭтотОбъект,
								ИмяКоманды,
								бг_ГруппаКоманд,
								ЗаголовокКоманды,
								ИмяКоманды,
								ИмяКоманды, ,
								ВидКнопкиФормы.КнопкаКоманднойПанели);
КонецПроцедуры

&НаСервере
Процедура бг_РаспределитьМатериалыПоПартиямПроизводстваНаСервере()
	БазаРаспределенияМатериалов = бг_БазаРаспределенияМатериалов();
	бг_РаспределениеПроизводственныхЗатрат.бг_РаспределитьМатериалыПоПартиямПроизводства(Объект, Объект.Распределить, БазаРаспределенияМатериалов);
	
	Объект.Распределить = 0;
КонецПроцедуры

&НаСервере
Функция бг_БазаРаспределенияМатериалов(ПартииПроизводства = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыпускПродукцииОбороты.Распоряжение КАК Распоряжение,
	|	ВЫРАЗИТЬ(ВыпускПродукцииОбороты.Распоряжение КАК Документ.ЭтапПроизводства2_2).Спецификация КАК Спецификация,
	|	ВЫРАЗИТЬ(ВыпускПродукцииОбороты.Распоряжение КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства КАК ПартияПроизводства,
	|	ВЫРАЗИТЬ(ВыпускПродукцииОбороты.Распоряжение КАК Документ.ЭтапПроизводства2_2).Подразделение КАК Подразделение,
	|	ВыпускПродукцииОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВыпускПродукцииОбороты.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|	ВыпускПродукцииОбороты.КоличествоОборот КАК Коэффициент
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			Организация = &Организация
	|				И ТИПЗНАЧЕНИЯ(Распоряжение) = ТИП(Документ.ЭтапПроизводства2_2)
	|				И (НЕ &ОтборПоПартиямПроизводства
	|					ИЛИ ВЫРАЗИТЬ(Распоряжение КАК Документ.ЭтапПроизводства2_2).ПартияПроизводства
	|							В (&ПартииПроизводства))) КАК ВыпускПродукцииОбороты";
	Запрос.УстановитьПараметр("НачалоПериода",              НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода",               КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Организация",                Объект.Организация);
	Запрос.УстановитьПараметр("ПартииПроизводства",         ПартииПроизводства);
	Запрос.УстановитьПараметр("ОтборПоПартиямПроизводства", ПартииПроизводства <> Неопределено);
	
	Результат = Запрос.Выполнить();
	ТаблицаВыпущеннаяПродукция = Результат.Выгрузить();
	
	ТаблицаСписокНоменклатуры = Справочники.РесурсныеСпецификации.СписокНоменклатуры();
	Для Каждого СтрокаПродукция Из ТаблицаВыпущеннаяПродукция Цикл
		НоваяСтрокаСписокНоменклатуры = ТаблицаСписокНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСписокНоменклатуры, СтрокаПродукция);
		НоваяСтрокаСписокНоменклатуры.Количество = СтрокаПродукция.Коэффициент;
	КонецЦикла;
	
	ПараметрыВыборкиДанных = Справочники.РесурсныеСпецификации.ПараметрыВыборкиДанных("МатериалыИУслуги");
	ДанныеСпецификаций = Справочники.РесурсныеСпецификации.ДанныеСпецификацииПоСпискуНоменклатуры(ТаблицаСписокНоменклатуры, ПараметрыВыборкиДанных);
	
	БазаРаспределенияМатериалов = Новый ТаблицаЗначений;
	БазаРаспределенияМатериалов.Колонки.Добавить("Распоряжение", Новый ОписаниеТипов("ДокументСсылка.ЭтапПроизводства2_2"));
	БазаРаспределенияМатериалов.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	БазаРаспределенияМатериалов.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.РесурсныеСпецификации"));
	БазаРаспределенияМатериалов.Колонки.Добавить("ПартияПроизводства", Новый ОписаниеТипов("СправочникСсылка.ПартииПроизводства"));
	БазаРаспределенияМатериалов.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	БазаРаспределенияМатериалов.Колонки.Добавить("Коэффициент", ОбщегоНазначения.ОписаниеТипаЧисло(15, 3, ДопустимыйЗнак.Неотрицательный));
	БазаРаспределенияМатериалов.Колонки.Добавить("СтатьяКалькуляции", Новый ОписаниеТипов("СправочникСсылка.СтатьиКалькуляции"));
	
	Для ИндексСтроки = 0 По ТаблицаВыпущеннаяПродукция.Количество() - 1 Цикл
		СтрокаВыпущеннаяПродукция = ТаблицаВыпущеннаяПродукция[ИндексСтроки];
		ДанныеСпецификации = ДанныеСпецификаций[ИндексСтроки];
		
		ОтборМатериалы  = Новый Структура("Номенклатура, Характеристика", Объект.Номенклатура, Объект.Характеристика);
		СтрокиМатериалы = ДанныеСпецификации.МатериалыИУслуги.НайтиСтроки(ОтборМатериалы);
		
		Для Каждого СтрокаМатериал Из СтрокиМатериалы Цикл
			НоваяСтрокаБазаРаспределения = БазаРаспределенияМатериалов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаБазаРаспределения, СтрокаВыпущеннаяПродукция);
			
			ЗаполнитьЗначенияСвойств(НоваяСтрокаБазаРаспределения, СтрокаМатериал);
			НоваяСтрокаБазаРаспределения.Коэффициент = СтрокаМатериал.КоличествоУпаковок;
		КонецЦикла;
	КонецЦикла;
	
	Если БазаРаспределенияМатериалов.Количество() = 0 Тогда
		БазаРаспределенияМатериалов = ТаблицаВыпущеннаяПродукция;
	КонецЕсли;
	
	Возврат БазаРаспределенияМатериалов;
КонецФункции

&НаСервере
Процедура бг_ПересчитатьРаспределениеМатериаловПоПартиямПроизводстваНаСервере()
	КоличествоРаспределить = Объект.Распределить + Объект.Количество;
	
	Партии = Объект.ПартииПроизводства.Выгрузить(, "ПартияПроизводства").ВыгрузитьКолонку("ПартияПроизводства");
	БазаРаспределенияМатериалов  = бг_БазаРаспределенияМатериалов(Партии);
	
	бг_РаспределениеПроизводственныхЗатрат.бг_РаспределитьМатериалыПоПартиямПроизводства(
																	Объект,
																	КоличествоРаспределить,
																	БазаРаспределенияМатериалов);
	
	Объект.Распределить = 0;
КонецПроцедуры

#КонецОбласти
